#include <stdio.h>
main()
{
    int a[10][10], i, j;									/*定义数组及变量为基本整型*/
    for (i = 1; i <= 5; i++)
    for (j = i; j <= 10-i; j++)
    {
        a[i][j] = i;									/*方阵中每次相对的上面一行等于i*/
        a[10-i][j] = i;									/*方阵中每次相对的下面一行等于i*/
        a[j][i] = i;									/*方阵中每次相对的左面一列等于i*/
        a[j][10-i] = i;									/*方阵中每次相对的右面一列等于i*/
    }
    for (i = 1; i <= 9; i++)
    {
        for (j = 1; j <= 9; j++)
            printf("%3d", a[i][j]);						/*将该方阵输出*/
        printf("\n");									/*每输完一行进行换行*/
    }
}
